# COLOR_SCHEME = {
#     "Red": ([0, 70, 50], [10, 255, 255]),
#     "Green": ([40, 40, 40], [70, 255, 255]),
#     "Blue": ([100, 150, 0], [140, 255, 255]),
#     "Yellow": ([25, 50, 50], [32, 255, 255])
# }
COLOR_SCHEME = {
    "Red": ([136, 45, 111], [180, 255, 255]),
    "Green": ([25, 45, 72], [102, 255, 255]),
    "Blue": ([90, 50, 2], [120, 255, 255]),
    # "Yellow": ([25, 50, 50], [32, 255, 255])
}

#
COLOR_HUE_RANGE = {
    "Red": [145, 175],  # [0,15] also
    # "Green": [40, 70],
    "Yellow": [30, 40],
    "Green": [43, 80],
    # "Blue": [90, 140],
    # "Blue": [102, 106],
   
}

# Минимальный и максимальный размер элемента
ELEM_SIZE_RANGE = [200, 10000]
